{
  "sizes": {
    "hamlet": [20, 50],
    "village": [51, 999],
    "castle-town": [150, 999],
    "town": [1000, 5000],
    "city": [5000, 15000],
    "metropolis": [15001, 99999]
  },
  "images": {
    "hamlet": "hamlet.jpg",
    "village": "village.jpg",
    "castle-town": "castle-town.jpg",
    "town": "town.jpg",
    "city": "city.jpg",
    "metropolis": "metropolis.jpg"
  },
  "economy": {
    "hamlet": {
      "main": [
        "farming",
        "fishing",
        "mining",
        "herding",
        "logging",
        "sorcerous materials",
        "medicinal plants"
      ]
    },
    "village": {
      "main": [
        "farming",
        "fishing",
        "mining",
        "herding",
        "logging",
        "sorcerous materials",
        "medicinal plants"
      ]
    },
    "castle-town": {
      "main": ["town market", "mercenaries", "mining", "logging"],
      "svDiff": {
        "blacksmith": 750,
        "armorsmith": 1000,
        "weaponsmith": 1000,
        "scabardMaker": 425,
        "saddler": 500,
        "inn": 1200,
        "apothecary": 1000,
        "bowyer": 425
      }
    },
    "town": {
      "main": ["town market", "industry", "mercenaries"]
    },
    "city": {
      "main": ["trade", "workshops", "guilds"]
    },
    "metropolis": {
      "main": ["trade", "workshops", "guilds"]
    }
  },
  "origins": {
    "Ancestral Land": "The citizens have been here for centuries, though the original settlement might have been little more than a riverside farming  hamlet. The locals have had a long time to develop the wealth and infrastructure of the town, and they rely on many works of their ancestors.",
    "Ancient Industry": "At one point this city or town was a major industrial site, one focused on the production of some widely-used commodity: pig iron production, precious metal smelting, fishing, logging, shipbuilding, or some other product in line with local capabilities. The present day may or may not see it still producing such things, but the legacy of the industry is increased wealth.",
    "Defensible Site": "The original settlers chose this site because it was unusually defensible. The locals spent a good deal of time considering the military ramifications of their location.",
    "Ethnocentrists": "The first citizens were determined to save their culture from the devastation of a foreign invasion, and founded this city to embody the customs and traditions that survived the exile. Most such settlements have no special animosity or scorn toward their neighbors, but they are grimly opposed to any mixing with “outsiders”. This dedication produces an unsurprising degree of social unity.",
    "Innovators": "The founders of this place wanted to do something new; they wanted to abandon the shackles of their former homes and strive to find an enlightened and wiser way to live. Most such surviving towns still have relics of that initial, idealistic period in the form of governmental quirks or odd customs, along with the wealth that came from a successful eagerness to try new things. Those innovators who chose less wisely can usually be found among the local Ruins.",
    "Outcasts": "The first settlers were the dregs and unwanted of a greater society. Perhaps they were bandits or low-caste laborers, or the unwanted and oppressed followers of some weakened culture. They came here to start a new city, one where they would be in the ascendant, and this sense of shared burden before an unfriendly world has given them strong social bonds.",
    "Rebels": "The initial settlement was involuntary. Some usurper lost a war, or a legitimate lord was driven out by a pretender, or a religion made too many assumptions about how far the local ruler would tolerate their demands. The losers of the quarrel ended up here, and they've built their town on the memory of that exile. The martial heritage and tradition of fighting that comes with them tends to make such places distinctly more militant than most.",
    "Religious Community": "The site was originally composed of earnest believers in a particular religion, or esoteric philosophical school. This religion may or may not have become watered-down over the years, but it leaves its traces firmly stamped on the town's character and laws, along with a sense of shared belief that helps tie the locals together.",
    "Survivors": "The first inhabitants were the survivors of some nearby catastrophe, often the fall of another city to infighting or a foreign warband. Those who lived fled their old lives to settle here. The weak had already died along the way, and the tough, ruthless core of the remnants still pass down traditions of martial stoicism and a keen awareness of the kind of actions necessary for survival.",
    "Trading Hub": "The settlement stands at a confluence of cultures or trade routes, and developed out of the rich profits to be had from commerce. Such communities tend to be somewhat mercenary-minded and flexible in their policies, always trying to keep on good terms with the various groups that trade there. Communities that command some valuable trade route can be more overbearing, greedily extracting the wealth that comes from their exclusive control of a trade river or isolated mountain pass."
  },
  "activities": {
    "Councils": "Most major settlements are firmly under the control of a lord or a local oligarchy of the most powerful families, and the wishes of the common people are largely irrelevant outside of such outrages as might provoke riot or rebellion. This settlement is unusual in that it provides the common people with some less violent means of influencing community policy. A city council stocked by more than the great families is one possibility, as are venerable traditions that give local citizens the right of voting or other such exotic privileges. While such public input can produce contention and quarreling, it also strengthens the feeling of unity and shared membership among the citizens.",
    "Destined Conquerors": "Something about the settlement's current society or leadership has convinced it that it is destined to ultimately rule its surrounds. Ambitious captains, the zeal of a new religion, or the simple detestation of neighboring debauchery or chaos might all provoke the community to take arms against resisters. Not all such settlements will be actively seeking combat, but they tend to spend a great deal of time and effort in preparing for the inevitable clash.",
    "Educational Tradition": "The locals have a profound respect for learning, and even commoners might be expected to have the rudiments of literacy. Some such settlements might have one of the small magical academies that have survived since the early days of the exile, while others could have grown from a central school of scholars or literary students. Some might focus on more practical concerns, such as engineering or innovations in agriculture. Whatever the specifics, the eagerness to learn brings uncommon wealth to the town- and perhaps the occasional small disaster as a clever new idea gets out of hand.",
    "Expert Artisans": "The settlement is abundantly supplied with expert crafters. Dwarven delves might have numerous skilled craftmothers at their forges, while human communities might nurture old skills and generations of polished expertise in a particular calling. Most such settlements specialize in transforming a readily-available local resource into something precious enough to draw distant gold to their markets.",
    "Martial Tradition": "The locals fight, have fought, and will fight again. Every family can boast of its scars and sacrifices, and the trade of the blade is honored and cultivated by the natives. Unlike simple nests of unruly rabble, these locals have some deeper tradition to organize and focus their martial exertions, perhaps as descendants of some ancient military unit gone to civilian life or as disciples of some martial religious faith. Even the dullest commoner can be expected to know the rudiments of handling a spear and maneuvering to the sound of drums, trumpets and gongs.",
    "Missionary Zeal": "The natives have something magnificent, and are bent on sharing it with others- occasionally whether or not the others are interested in having it. A vibrant local religion, a particular cultural tradition, an idealistic founding principle or a general sense of civic superiority infuses the locals and leaves them eager to share their bounty with their neighbors. This sense of mission can bind the common folk together in a feeling of shared destiny.",
    "Mutual Defense": "The settlement has numerous allies among the surrounding villages and hamlets, and this diplomacy may even extend to intelligent nonhumans in the nearby area. The settlement may have a tradition of open-handed generosity to its neighbors, or the luck of being sited near uncommonly reasonable nonhumans, or simply a very supple-tongued corps of diplomats. Whatever the specifics, these allies can be expected to lend their spears when trouble rises for the community.",
    "Production Center": "A town full of expert artisans is a community that brings forth exquisite marvels. A city famed as a production center simply makes a lot of something. Rice, iron, timber, fish... the community is a major source of some basic commodity. It may or may not produce some finished goods along with the raw supplies, but the largest part of its wealth comes from the export of its most abundant resource. The merchants and land-owning lords who control this resource often have unusual power over the community's governance.",
    "Strong Society": "The community has been tested in the past but it has come through its trials unbowed. Many of the typical fissures and feuds that lace any significant population center have been resolved to at least grudging acceptance by all involved and the common folk have worked out the worst of their differences with their rulers. In some cases this may have been the product of wise-headed civic elders, and in others it may have been the consequence of a horrifically bloody purge such as leaves the natives shuddering at the very thought of returning to such chaos. While their current condition is somewhat less dramatic, such civic stability leaves the locals able to focus their efforts with minimal infighting.",
    "Vigorous Trade": "The settlement may or may not have been founded as a trade hub, but it has recently found mercantile wealth. There may have been a new mineral strike, a new trade route cut through the wilderness, or some long-lost ruin's rediscovery calling freebooters from afar. Other settlements have worn their wealth for a longer span, their original founding purposes smoothed out under a flow of trade."
  },
  "obstacles": {
    "Bad Reputation": "The place is a byword for rapacious officials, thieving merchants, vicious peasants, grasping magistrates, and all the worst habits imaginable by their neighbors. No one dares to have any more trade with them than they absolutely must, and the natives of the place are considered one cut better than outright bandits. In some cases, this reputation is entirely deserved, and the locals really are as pure a lot of unmitigated bastards as they are said to be. In other cases the spite is a relic of some ancient quarrel or dusty hate that lives on in mutterings and contempt.",
    "Class Hatred": "The poor hate the rich, the rich hate the poor, the farmers hate the herdsmen and the herdsmen hate the farmers. The location is riven with vicious quarrels and mutual despite, as at least two major classes of inhabitants absolutely detest each other. In some cases the merit of one side or another might be relatively clear, but the sheer loathing guarantees that any conventional justice will rapidly degenerate into savage score-settling and brutal reprisal. Most such places exist in a tenuous and bloody balance until one side gets the upper hand and an orgy of violence settles matters for good.",
    "Contaminated Land": "The earth is poisoned, either by bitter salts from poor irrigation techniques, a toxin naturally present in the local soil, or the vile influence of supernatural forces. Crops are ragged and sparse, and some lands leave their inhabitants sick with persistent coughs, weeping boils, reddened eyes, or disturbing sorcerous mutations. The locals would have moved away by now, but the fouled earth tends to encourage bandits and robber-princes to stay well away.",
    "Corrupt Leadership": "The local leadership is utterly corrupt. All thoughts of duty and selfless obligation have been abandoned in favor of sheer avarice and the pleasures of rule. Nothing can be accomplished without the favor of one of the local leaders, and that approval can only be acquired through bribes and shameful favors. The leaders would rather be unquestioned masters of a poor place than dutiful servants of a wealthy one.",
    "Crushed Spirits": "The locals exist in a state of abject degradation. They have suffered poverty, tyranny, or misfortune so long that they can no longer imagine any better existence. Their lives are brutal with privation and many of the kinder and more selfless impulses of humanity have been stamped out by the harshness of their circumstances. They dream of nothing better and hope for nothing more elevated than another day of existence. Even those opportunities that do lie before them often go untried out of simple hopelessness.",
    "Demagogue": "The locals are in the thrall of a zealous demagogue. He or she is preaching some vicious or foolish creed, one that leaves the locals hostile to outsiders or spending all their spare effort towards aggrandizing some strange cause. Productive labors are abandoned in favor of rallies, festivals, and the occasional pogrom against unbelievers.",
    "Destructive Customs": "For uncounted generations the locals have stubbornly adhered to customs and traditions that are ruinous to long-term prosperity. Their surplus goods might be sacrificed yearly to some ancestral deity, or women might be crippled in childhood to demonstrate the wealth of a family that can afford to lose their labor, or a large portion of the population might be ritually forbidden from performing useful work. At some point in the past these customs might have been based on some real need, but now they only serve to keep the people poor and weak.",
    "Disunity": "The community has turned against itself, with families and factions atomized into hostile, suspicious camps. Both great fortune and great misery can lead to such squabbling, either in the division of a windfall to the community or the remorseless need to claim scarce resources for survival. The various groups cannot trust each other enough to pool their efforts toward something better, and old grudges and slights are preserved as reasons to keep tomorrow as suspicious as today.",
    "Ethnic Feuding": "Most settlements get along without significant ethnic tension between humans and demihumans. Still, when multiple ethnic groups in a community have contradictory interests, it's easy for quarreling purposes to turn into blanket condemnations of an entire group. Locations plagued with ethnic feuding have devolved into clannish, spiteful groups convinced that their neighbors are prey to all manner of contemptible vices and that everything will be better once they're driven out to go to their own kind.",
    "Exceptional Poverty": "On the frontier, few people are rich in any conventional sense. Even those with knee-high mounds of golden nuggets and crates full of the pelts of rare jungle animals must make do with coarse food, primitive quarters, and a life of constant peril. Still, most settlements manage to give the necessities of decent life to those with hands for hard work and a few strokes of luck. Settlements laboring under exceptional poverty are not so fortunate. Either because of the cruel exactions of outside lords, the depredations of local rulers, or the miserable infertility of the local soil, the natives are hard-pressed even to find enough to eat.",
    "Flooding": "In hot climes a monsoon rain can swell the streams, and in cooler ones the spring snowmelt can turn mountain rivulets into roaring torrents. The location is prone to severe seasonal flooding, and the waters are too unpredictable and untamed to allow for easy agriculture. The locals might remain in such a place simply because no outsider has much interest in harassing them there, or because some valuable produce requires the abundant water.",
    "Mercenary Populace": "The locals are an honorless and mercenary lot, careless of their promises and interested only in immediate gain. Agreements struck with them are kept precisely so long as they remain profitable, and not a moment longer. The natives might be more trustworthy toward their own kind, but outsiders are viewed as sheep to be sheared. A good offer from a rival will see them turn their coat in a blink.",
    "Monsters": "Brute beasts and hissing things in the night creep about the place, pouncing upon the unwary and doing cruel injury to the flocks and herds of any locals. Travelers cannot follow the trails in safety, and men and women do not open their doors after the sun goes down. These monsters are rarely intelligent, but their animal cunning and vicious hungers are unrelenting as any bandit's cupidity.",
    "Pervasive Hunger": "The locals suffer often from famine, and many of the natives are marked with the subtle scars of malnutrition. It may be that the surrounding lands are very poor for agriculture, or it may be that the settlement simply has too many people crammed within it. If the land were truly barren the locals would be forced to move or starve, but the harvests are just sufficient to keep most of them alive- and too weary and fearful of worse to pack up and move. The site may provide rich supplies of some other goods or resources that leave the residents willing to put up with their hunger.",
    "Recurrent Sickness": "There is evil air in the place, or sickly water, or a confluence of geomantic influence propitious to plagues and fever. It may be that a god of disease has a shrine here, his servants diligent in their cultivation of sicknesses that never touch the faithful. Plague spirits may haunt ruins or noisome jungle glens, and their sendings might leave the natives listless with illness and weary suffering.",
    "Riotous Thugs": "The locals are thoroughly unruly, given to brawling, casual violence against enemies, and a careless contempt for legal process. It's all but impossible to extract any sort of useful service or taxation from them so long as they persist in their habits of hostility and tendency to riot.",
    "Secret Society": "There is a secretive band of conspirators in the place that act as its true rulers. The chieftains or officials who seem to be the local government are no more than catspaws or luckless puppets of the secret society, and the natives are hushed with fear at the thought of incurring their inescapable wrath. Before any outside power can be master here, the society must be broken or coopted to their service.",
    "Raiders": "Savage tribes of orcs or goblinoids can strike deep into settled human lands, moving fast with their tireless stamina and intimate knowledge of the land. Every monsterous creature old enough to hold a dagger is a dangerous combatant, and they burn with a bitter resentment toward the exiles and their interloping settlements. Some might cluster around ancient ruins, defending them as ancestral holdings or sites of great ritual importance. Whatever the case, this site is plagued by a persistent and relentless band of raiders, ones unwilling to be driven away by ordinary reprisals.",
    "Chaos Cult": "Despite the universal revulsion for the gods of chaos and their servants, the frontier is sparsely-settled enough for some places to become nests of chaos worship and gateways through which sinister demons might extend its nightmarish influence. This site suffers from a dangerously advanced Chaos Cult, with a priesthood approaching sufficient power to open a way for an influx of chaos abominations. Local natives may hate the cult, but they are powerless to resist it.",
    "Xenophobia": "The locals despise foreigners of every stripe. Cities will tend to deal only with those villages and market towns composed of their own culture or ethnicity, while towns might hold themselves haughtily apart from trade with “inferior foreign cities”. Most such settlements are notably poorer than others of the same size, as they accept only trade from tolerable merchants. Outsiders of the wrong sort are rarely permitted within the walls, and even then are often restricted to a particular “foreign quarter” neighborhood. Until this xenophobia is broken the city is of no use to a polity composed of more variable folk."
  },
  "ruins": {
    "natures": {
      "Abandoned Town": "The ruins were a prosperous town once, but disaster or encroaching hardship drove out the original inhabitants. Perhaps the water supply failed, or plague ravaged the populace, or trade routes shifted and starved the people. Natural disasters such as mudslides, earthquakes, volcanic eruptions, or tsunamis might have smashed the buildings and left the survivors fleeing for less accursed soil.",
      "Ancient Settlement": "The ruins date back before collective mortal memory. The descendants of those that settled here might still jealously hold their ancestral home, or the rigors of the land might have left their halls filled with orcs, goblins, wild beasts, and the bones of the restless dead. Most such groups had very good reasons for seeking a new home, and many were inclined to pursue ends less acceptable in civilized lands.",
      "Broken Temple": "Whether a monastery, shrine, pilgrimage site, or seminary, this ruin was once the center of a powerful local faith. It may have been a remote outpost of missionary zeal, manned by daring priests seeking to provide a foothold in the wilderness. It may have been the last remnant of a failed colony, the survivors huddled at the feet of their mute idols. Such places often have lingering power, and can attract those entities that seek to feed on the ashes of the numinous.",
      "Crumbled Fortress": "The ruins were a potent fortress once, a castle, keep, walled tower, or military camp pledged to some local power. War or poverty broke its walls at last, however, and the impossibility of maintaining it has let other things find homes in the empty halls. Such ruined fortifications are a favorite haunt of bandit warlords.",
      "Dwarven Hold": "The dwarves have dwelled there for centuries, but even before they came there were delvings that seemed to be of dwarven make. None know what became of these ancient ones, but their houses of stone deep in the earth remain to tempt hungry-handed adventurers. More modern delvings are occasionally destroyed by the relentless attacks of orcs or goblins, or the creeping tide of monstrous evil that wells up from deep below.",
      "Empty Tower": "Perhaps it was a wizard's lair once, or a bandit's favored watchpost, or the nucleus of a castle that has long since fallen to rubble around it. Such ruins are favored by necromancers, devilworshippers and other such sinister figures who prefer isolation and a home small enough to be maintained by a few loyal minions but defensible enough to be held against most interlopers.",
      "Failed Colony": "Many towns and youthful cities were founded as colonial endeavors, while the orc warbands were still scattered and taken aback by the strange intruders. Some of these settlements were quite successful in their season, prospering with the resources of untouched lands. When the orc warbands marched forth in years past, many of these young cities and towns were put to the torch and ravaged by the furious humanoids. Men and women of later days tend to shun them for fear of the restless dead, still furious over unburied bones and an uncertain afterlife to come.",
      "Forsaken Outpost": "Many domains have tried to push back the wilderness, and the wilds are dotted with the ruins of their outposts. Crumbling buildings, tottering border towers, and caves reworked into makeshift barracks are all to be found in the untamed lands, their original occupants long since dead or withdrawn. These outposts were usually placed near fresh water and significant military points, and so often attract less scrupulous tenants.",
      "Lost Mine": "The mountains and hills are rich with precious metals and useful ores. Sometimes this bounty provokes hungry men to dare deeper into the wilderness than they ought to go, and the natural perils take them before they can get the pleasure of their new wealth. The caves and tunnels they leave behind make homes for many creatures, and smelted ingots of gold and silver can still be found tucked away in hidden vaults.",
      "Plundered City": "An abandoned town is left empty by the cruel dictates of nature, but a plundered city was smashed purposefully by men. The city somehow ended up on the wrong side of a war and its ruination was crushing and complete. It may have been the last stronghold of some incurably militaristic refugee group, or victim to the mad zeal of some conquering religion, or simply sacrificed to oncoming hordes of orcs in favor of fighting them at a more defensible location. The swift destruction often leaves a great many valuables in among the bones of the unquiet dead.",
      "Prehuman Ruins": "These lands knew civilized inhabitants long before the coming of men. The black basalt cities of the ancient lizardfolk can be found deep in the jungles, and the strange, harshly elegant lines of cities unknown to men can still be found within the mountain valleys. Some lunatics insist that these cities were actually the work of ancient demigods, but more sober scholars credit such places to demons, for the artifacts found within are often strange and terrible in their effects.",
      "Shattered School": "Isolation is often profitable for the study of magic, and the consequences of mistakes are less injurious when bystanders are scarce. Sometimes these little errors result in sundered buildings and hideously-warped faculty. At other times the mages are driven from the school by infuriated locals, or struck down by hostile lords or rampaging orc bands. In all cases, the remains are likely to be crusted over with unpredictable artifacts of spoilt magic and festering sorcery."
    },
    "traits": {
      "Ancient Armory": "The ruins have substantial stores of unplundered weapons, armor, or siege engines. Some might even have usable squadrons of war-golems keeping a perpetual vigil over the decay of centuries. Ancient dwarven delves might maintain hidden vaults of killing tools, while haunted battlefields might have infused their corroded blades with the unholy vigor of their unquiet masters. Whatever the specifics, the power that seizes the ruins will gain significant military benefit from the remains.",
      "Buried Treasure": "There is loot to be had in the wreckage, often of a kind too cumbersome to offer practical plundering opportunities to small bands of adventurers or raiders. Great jade pillars, massive doors of black bronze, wall panels of gilded brass, and other such costly, heavy furnishings might have proven too burdensome to be levered away centuries ago, but will yield up their value to a Domain able to dispatch a sufficient number of workers to salvage the ruins.",
      "Commanding Location": "The ruin is placed at a military strong point. The site likely has ample access to fresh water, an elevated view of the surrounding land, and a restricted means of approach sufficient to prevent easy rushes. If an organized military power is able to take control of the place, they'll have a superb base for exerting their influence on the surrounding countryside.",
      "Forgotten Sorceries": "The inhabitants of the ruins were puissant sorcerers, versed in secrets and subtleties that have long since been lost to the world. There may be tomes of hammered copper pages and spines of blackened iron, or clay tablets of some prehuman race, or bas-reliefs illustrating the arcane pandects of lost gods. Most such secrets rely on elaborate constructions or the magical significance of the ruins, making it impractical to practice them away from the site. Study of these occult leavings requires time and effort but promises significant advantage to a Domain",
      "Glorious Dead": "A great and magnificent battle took place in the ruins. Some such struggles involved substantial magical energies or the interference of some divine power, while others were simply the product of ferocious valor and exemplary martial courage. The shades of these heroic warriors remain present to a degree, and can be propitiated with the correct sacrifices and reverences to their memory. The Domain capable of winning the blessing of these ancient heroes will find subtle but significant advantages in their wars.",
      "Great Art": "The ruin is adorned with exquisite art, usually in some medium that can be expected to survive the grinding years. Statuary, bas-reliefs, frescoes, work in bronze and other enduring metals, and mosaics are all common examples. Possessing ownership of the site confers prestige and cultural esteem on the Domain in control of the ruins, and can be expected to inspire local artists to new heights of innovation.",
      "Lost Techniques": "The original inhabitants of the ruins were privy to unique techniques of metalwork, smelting, porcelain-making, medicine, architecture, or some other profitable art. Many of these techniques might be reliant on engines or resources found only within the ruins, and most require substantial investments in research and undisturbed experimentation to replicate. The Domain that manges to bring them back into use can expect to profit.",
      "Pre-Exile Relics": "The ruin contains substantial caches of artifacts dating back before the great cataclysm, often including precious books and cultural artifacts. Many such tokens were common or trifling in the days before the fall, but now they serve as some of the few strands that connect the present days to a lost and glorious past. Possessing these relics and their ancient home brings pride and renewed hope to the domain that controls them.",
      "Rich Resources": "Precious metals, rare clays, unique drug plants that grow only under the influence of the ruin's specific feng shui, or other valuable raw materials can be found in or near the ruins. The dangers of the place may have fended off more casual colonists, but the Domain that can clear and hold the ruins can gain much profit from their extraction.",
      "Scattered Heirs": "The ruins were once the seat of a powerful noble house, lineage of sorcerers, scholarly family, dwarven clan, or other strong organization. These heritors have since scattered, but a Domain capable of reclaiming the ruins and rendering them habitable once more can win these heirs to their cause and benefit from the fierce loyalty of exiles returned to a home once lost.",
      "Seat of Legitimacy": "Long ago the ruins were the capital or cultural seat of the surrounding countryside, or a sacred place beloved of a powerful local cult. The rule of the place was broken in times past, but if a Domain is able to retake the place, it can benefit from the aura of legitimacy and rightful rule that possession confers upon a ruler.",
      "Willing Recruits": "Either in or near the ruins are a significant number of strong, warlike souls who could be turned to a Domain's service if the ruins are successfully taken. Violent inhabitants might cheerfully turn their destructiveness on the enemies of their new masters, impressed by their show of might- or they might be a neighboring folk, grateful for being freed of the constant threat of the ruin's inhabitants."
    },
    "obstacles": {
      "Ancient Curse": "The ruin suffers under an ancient curse. Some are scourges inflicted by an angry prophet or sorcerer who had reason to hate the former occupants, while others are the product of a dying lord's rage against the destroyers of his people. Such powerful curses are subtle but pervasive, touching everything that takes place near the ruins. Crops fail, craftwork splinters, despair shadows all manner of labors, and misfortune dogs every action. Particularly powerful curses might apply actual penalties to hit rolls or saving throws within the area, or lessen the Morale score of forces compelled to fight in the shadow of their broken walls.",
      "Angry Dead": "The dead of the ruins are furious. Sometimes these spirits are angry for comprehensible reasons, such as the unburied and unlamented condition of their bodies or the terrible way in which they died. In other cases these angry dead seem to spontaneously erupt from incomprehensible causes and strange tides of evil fortune. Necromancers and other deathworkers are the most common sources of this plague of wrathful corpses.",
      "Barren Surroundings": "Perhaps the place had good crops and abundant resources once, but such sweet days are long in the past now. The land surrounding the location is rocky, arid, infertile, or otherwise barren. Growing crops is a struggle, and few local resources are available to sustain the location. The people are worn down with the hardship of their lives, and almost all their waking hours are devoted to scratching a bare existence from the unhappy land.",
      "Conquering Heirs": "The ruin still has remnants of at least one faction of original inhabitants, and they have vigorous plans for bringing nearby communities under their control. They may be locked away by ancient wards, or kept squabbling amongst themselves until now, or otherwise restrained until relatively recently, but it will be impossible to effectively exploit the ruins so long as their megalomaniacal dreams go uncrushed.",
      "Dark Wizards": "The location is plagued with wizards of the worst kind. Goryhanded blood sorcerers from Tien Lung, insidious necromantic adepts, demonic pactmakers or mad alchemists- whatever the specifics, the locals are cursed with one or more powerful sorcerers. Attempts to drive off the wizards have failed, and the locals are resigned to suffering under their cruel exactions or capricious experiments.",
      "Destructive Customs": "For uncounted generations the locals have stubbornly adhered to customs and traditions that are ruinous to long-term prosperity. Their surplus goods might be sacrificed yearly to some ancestral deity, or women might be crippled in childhood to demonstrate the wealth of a family that can afford to lose their labor, or a large portion of the population might be ritually forbidden from performing useful work. At some point in the past these customs might have been based on some real need, but now they only serve to keep the people poor and weak.",
      "Disputed Possession": "One or more neighboring warlords, chieftains, or communities claims the location for their own, and either their competitors or the location's natives are resisting with force. Whether due to weakness or indifference, the claimants aren't pushing outright war on the location, but the regular raids and subsidized banditry involved makes life cruelly harsh for the locals.",
      "Exiled Lord": "Even lords and nobles must answer for certain crimes, ones too heinous to admit of privilege. These exiles almost always nurse a bitter grievance against their former homes, furious at the injustice of being deprived of their rightful lands and titles over some minor, understandable peccadillo. They usually have at least some henchmen and minions still loyal to them, and may have a significant backing in their former home due to old favors or anticipation of new ones should they be restored. Many gather bandits and other rabble around their banner in order to take their old place back by force.",
      "Human Raiders": "Orc warlords and savage beasts are not the only dangers on the frontier. Humans are a plague upon their own kind, with brutal bandits and soulless reavers moving from settlement to settlement to shear them of their wealth. They are not soldiers or conquerors who stand to fight a militia or challenge a local lord- they are simply thieves and robbers who strike only when resistance is weak and property is vulnerable to their hungry grasp.",
      "Inaccessible": "Sturdy travelers with agile feet can reach the location, but wagons or boats find it inaccessible. The site is situated inconveniently for trade, perched atop a high rock or buried deep within an abandoned delving or cave. Reaching it might require climbing a high peak or navigating a noxious swamp. While individuals can make this journey, substantial trade is all but impossible, leaving any residents bereft of the prosperity of the outside world.",
      "Monsters": "Brute beasts and hissing things in the night creep about the place, pouncing upon the unwary and doing cruel injury to the flocks and herds of any locals. Travelers cannot follow the trails in safety, and men and women do not open their doors after the sun goes down. These monsters are rarely intelligent, but their animal cunning and vicious hungers are unrelenting as any bandit's cupidity.",
      "Murderous Heirs": "The ruins are not as abandoned as one might expect, for within them dwell the ragged remnants of their former owners. Some have managed to retain the culture and sophistication of their better past, eking out an existence in the dust and wreckage as best they can. Others have gone wholly feral, scavenging the bones of the honored dead for anything of use or value. In either case, however, these heritors nurse a burning hatred for the outside world, and respond with ferocious violence to any trespass on their lands.",
      "Relic Golems": "There are countless failed colonies, prehuman settlements, and long-lost cities can be found within the jungles, swamps and high peaks. In these places lurk relic golems of numerous different types. Some are Men of Clay and Jade, mindless servants of a long dead-purpose, while others might be Porcelain Servitors capable of intelligent thought in service of their ends. War-golems also wait patiently for masters who will never return, and stranger beings built by vanished races can make an overgrown plantation or abandoned mine into a place of death for any stranger.",
      "Severe Damage": "Something terrible happened to the place in the past, and the ruins still bear the scars of the devastation. Where most ruins are either sufficiently intact or sufficiently exposed to allow for straightforward investigation and plundering, this one has been sealed away by some disaster. Tumbled walls, churned earth, burnt structures, flooded tunnels, and half a hundred other obstacles might all conspire to make the site a useless pile until it has been sufficiently repaired and cleared to admit of real excavation.",
      "Raiders": "Savage tribes of orcs or goblinoids can strike deep into settled human lands, moving fast with their tireless stamina and intimate knowledge of the land. Every monsterous creature old enough to hold a dagger is a dangerous combatant, and they burn with a bitter resentment toward the exiles and their interloping settlements. Some might cluster around ancient ruins, defending them as ancestral holdings or sites of great ritual importance. Whatever the case, this site is plagued by a persistent and relentless band of raiders, ones unwilling to be driven away by ordinary reprisals.",
      "Sinister Cult": "The location is under the control of a nefarious band of cultists associated with some bloodthirsty god or malevolent supernatural being. It may be that the cultural relics of some ancient faith have come down in bits and pieces to form the outline of some gruesome sect. The cult may or may not be a matter of public admission in the area, but everyone knows that it and its hierarchy are the true masters of the place, and any resistance to its dictates is sure to be punished with blood and hideous afflictions.",
      "Taboo Land": "The place is forbidden to common folk. It may be that an ancient curse has dissuaded them, or some recent catastrophe, or the stern prophecies of local religious leaders. For whatever reason, no common laborer will dare to live here and the extraction of resources or valuables will be impossible unless carters and workers can be convinced that the land is no longer forbidden.",
      "Things From Below": "The earth is maggot-eaten with passages and caverns, and there are things beneath the sunlight's reach that wait and hunger. Monsters breed in these dark places and creep out at night to snatch livestock and unwary travelers. These beasts are usually feral things without higher thought, but some are intelligent enough to treat the human natives as livestock. Those who remain docile and obedient are culled infrequently, while those who try to resist or flee the site are captured and devoured.",
      "Chaos Cult": "Despite the universal revulsion for the gods of chaos and their servants, the frontier is sparsely-settled enough for some places to become nests of chaos worship and gateways through which sinister demons might extend its nightmarish influence. This site suffers from a dangerously advanced Chaos Cult, with a priesthood approaching sufficient power to open a way for an influx of chaos abominations. Local natives may hate the cult, but they are powerless to resist it.",
      "Chaos Spawn": "A cult has grown strong enough to open a way for the Realm of Chaos to send forth its monsters. The gate may still be open or it may have guttered out after emitting a wave of misshapen horrors. In either case, the Chaos Spawn are so strong and numerous that they are certain to overwhelm any ordinary colony or labor camp. The site is uninhabitable until they are cleared."
    }
  }
}
